Page({
  data: {
    list: [{
        image: 'https://i0.hdslb.com/bfs/bangumi/bad54063f49aaf6b4e115050029c0df02c17dab8.jpg@412w_548h_1c.webp',
        name: '中国惊奇先生',
        intro: '简介：电影《中国惊奇先生》改编自权迎升创作的同名青年漫画，讲述道法传人王小二、警花、老警察组成的“驱魔铁三角”组合，侦破各种灵异系列案件的故事。北京某胡同内，常发生下班女子惨遭色狼强暴、碎尸案件。警察牛叔多次调查后断定，此系列案件非人类所为。阴差阳错之下王小二结识了女警花李雪，屌丝道士王小二为追求警花，开始帮助警方侦破各种灵异案件，由此展开了一系列不可思议的事件。'
      },
      {
        image: 'https://i0.hdslb.com/bfs/bangumi/5bee2f7688f4264c6cdbb983aec0205b6b7c9d3b.jpg@412w_548h_1c.webp',
        name: '罗小黑战记',
        intro: '简介：在熙攘的人类世界里，很多妖精隐匿其中，他们与人类相安无事地生活着。猫妖罗小黑因为家园被破坏，开始了它的流浪之旅。这场旅途中惺惺相惜的妖精同类与和谐包容的人类伙伴相继出现，让小黑陷入了两难抉择，究竟何处才是真正的归属？'
      },
      {
        image: 'https://i0.hdslb.com/bfs/bangumi/image/31ebf41959c8d5bcee857198d6ff3823581d0a37.png@412w_548h_1c.webp',
        name: '正义联盟 ',
        intro: '简介：超人离去，举世陷入哀悼之中。可是世界并未就此和平，恶势力蠢蠢欲动，犯罪气焰重新抬头。更为糟糕的是，来自远古的可怕威胁正渐渐逼近。在很久很久以前，亚特兰蒂斯人、亚马逊人和神族联合对抗邪恶的荒原狼。历经艰苦的斗争，荒原狼最终战败，被迫流放，而他留在地球上的三个盒子则分别由亚特兰蒂斯人、亚马逊人和普通人类看管。如今荒原狼卷土重来，地球被邪恶的阴影笼罩。值此危急关头，神奇女侠戴安娜、蝙蝠侠布鲁斯·韦恩、海王、闪电侠、钢骨维克多·斯通等五名正义战士走到一起。他们结成正义联盟，与荒原狼大军展开殊死之战…'
      },
      {
        image: 'https://i0.hdslb.com/bfs/bangumi/image/5d2547fccd75717eab7426cb94b021ec71473b76.png@412w_548h_1c.webp',
        name: '环太平洋',
        intro: '简介：近未来，地球环境逐步恶化。神秘外星殖民者通过大洋底部的虫洞“缺口”将身形庞大、残冷迅猛、身藏剧毒的怪兽接连派往地球，有条不紊地实施着它们的殖民毁灭计划。为此，人类联手打造“贼鸥计划”，制造出与怪兽体型相当的机甲战士迎战，但随着怪兽渐次进化，机甲战士全面溃败，各国政要试图修筑偏于防守的“生命之墙”以阻挡侵略者的脚步，无奈很快遭遇挫折。在此危急关头，暗中仍推进“贼鸥计划”的斯特克·潘特考斯特将军找回五年前曾遭受重大打击的“危险流浪者”驾驶员，并通过严格选拔为他选择了新的搭档森麻子。复活的“流浪者”即将与另外三台仅存的机甲战士迎战更强大的怪兽侵略者，同时寻找彻底扫除敌人的良机。苍茫的大海之上，人类保卫之战接连而起……'
      },
    ]
  },
  toDetails(e) {
    let item = e.currentTarget.dataset.item
    let image = item.image
    let name = item.name
    let intro = item.intro
    wx.navigateTo({
      url: `/pages/details/index?image=${image}&name=${name}&intro=${intro}`
    })
  },
})